app/views/posts/show.html.erb

SELECT `comments`.* FROM `comments` WHERE (`comments`.post_id = 1)
---

<% unless @post.comments.blank? %>