app/controllers/admin_controller.rb

SELECT `posts`.* FROM `posts`
---
  def index
    @posts = Post.all.paginate :page => params[:page], :per_page => 10