app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(params[:comment])
    @comment.user = @user

    if @comment.save
---
INSERT INTO `comments` (`content`, `post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('asdfasdf', 1, 1, '2011-03-28 14:20:04', '2011-03-28 14:20:04')

  def show
    @comment = Comment.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1

  def find_post
    @post = Post.find(params[:post_id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1