app/controllers/forums_controller.rb

SELECT `forums`.* FROM `forums`
---
  def index
    @forums = Forum.all.paginate :per_page => 10, :page => params[:page], :order => 'created_at DESC'

SELECT `posts`.* FROM `posts` WHERE (`posts`.forum_id = 1) ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def show
    @posts = @forum.posts.paginate :page => params[:page], :per_page => 10, :order => "created_at DESC"

INSERT INTO `forums` (`name`, `description`, `created_at`, `updated_at`) VALUES ('test', 'test', '2011-03-28 14:18:41', '2011-03-28 14:18:41')
---
  def create
    @forum = Forum.new(params[:forum])
    flash[:notice] = "forum successfully created..." if @forum.save

SELECT `forums`.* FROM `forums` WHERE `forums`.`id` = 1 LIMIT 1
---
  def find_forum
    @forum = Forum.find(params[:id])