app/controllers/posts_controller.rb

  def create
    @post = @forum.posts.build(params[:post])
    @user = User.find(session[:user_id])
    @post.user = @user
    if @post.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `posts` (`title`, `content`, `forum_id`, `user_id`, `created_at`, `updated_at`) VALUES ('test', 'tester', 1, 1, '2011-03-28 14:19:10', '2011-03-28 14:19:10')

  def find_forum
    @forum = Forum.find(params[:forum_id])
---
SELECT `forums`.* FROM `forums` WHERE `forums`.`id` = 1 LIMIT 1

  def find_post
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1