app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `hashed_password`, `salt`, `isadmin`, `created_at`, `updated_at`) VALUES ('test', '00b9aadbe5d8092c1745a52c6e172a8b495bfaff', '129273800.5010879767382204', 0, '2011-03-28 14:14:37', '2011-03-28 14:14:37')
---
  def create
    @user = User.new(params[:user])
    flash[:notice] = "User was successfully created..." if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def find_user
    @user = User.find(params[:id])